burakenez/gd32f5xx-demo-suites-cmake-vscode/Projects/GD32F527I_EVAL/11_I2C_EEPROM/GD32F5xx.svd
    </registers>
</peripheral>
<peripheral>
    <name>DAC</name>
    <description>Digital-to-analog converter</description>
    <groupName>DAC</groupName>
    <baseAddress>0x40007400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>TIMER5_DAC</name>       
        <value>54</value>
     </interrupt>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DDUDRIE1</name>
              <description>DAC1 DMA Underrun Interrupt enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDMAEN1</name>
              <description>DAC1 DMA enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWBW1</name>
              <description>DAC1 noise wave bit width</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWM1</name>
              <description>DAC1 noise wave mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTSEL1</name>
              <description>DAC1 trigger selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEN1</name>
              <description>DAC1 trigger enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBOFF1</name>
              <description>DAC1 output buffer turn off</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEN1</name>
              <description>DAC1 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDUDRIE0</name>
              <description>DAC0 DMA Underrun Interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDMAEN0</name>
              <description>DAC0 DMA enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWBW0</name>
              <description>DAC0 noise wave bit width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWM0</name>
              <description>DAC0 noise wave mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTSEL0</name>
              <description>DAC0 trigger selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEN0</name>
              <description>DAC0 trigger enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBOFF0</name>
              <description>DAC0 output buffer turn off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEN0</name>
              <description>DAC0 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWT</name>
        <displayName>SWT</displayName>
        <description>Software trigger register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SWTR1</name>
              <description>DAC1 software trigger, cleared by hardware</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWTR0</name>
              <description>DAC0 software trigger, cleared by hardware</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_R12DH</name>
        <displayName>DAC_OUT0_R12DH</displayName>
        <description>DAC0 12-bit right-aligned data holding register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC0_DH</name>
              <description>DAC0 12-bit right-aligned data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_L12DH</name>
        <displayName>DAC_OUT0_L12DH</displayName>
        <description>DAC0 12-bit left-aligned data holding register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC0_DH</name>
              <description>DAC0 12-bit left-aligned data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_R8DH</name>
        <displayName>DAC_OUT0_R8DH</displayName>
        <description>DAC0 8-bit right-aligned data holding register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC0_DH</name>
              <description>DAC0 8-bit right-aligned data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT1_R12DH</name>
        <displayName>DAC_OUT1_R12DH</displayName>
        <description>DAC1 12-bit right-aligned data holding register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC1_DH</name>
              <description>DAC1 12-bit right-aligned data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT1_L12DH</name>
        <displayName>DAC_OUT1_L12DH</displayName>
        <description>DAC1 12-bit left-aligned data holding register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC1_DH</name>
              <description>DAC1 12-bit left-aligned data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT1_R8DH</name>
        <displayName>DAC_OUT1_R8DH</displayName>
        <description>DAC1 8-bit right-aligned data holding register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC1_DH</name>
              <description>DAC1 8-bit right-aligned data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DACC_R12DH</name>
        <displayName>DACC_R12DH</displayName>
        <description>DAC concurrent mode 12-bit right-aligned data holding register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC1_DH</name>
              <description>DAC1 12-bit right-aligned data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC0_DH</name>
              <description>DAC0 12-bit right-aligned data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DACC_L12DH</name>
        <displayName>DACC_L12DH</displayName>
        <description>DAC concurrent mode 12-bit left-aligned data holding register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC1_DH</name>
              <description>DAC1 12-bit left-aligned data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC0_DH</name>
              <description>DAC0 12-bit left-aligned data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DACC_R8DH</name>
        <displayName>DACC_R8DH</displayName>
        <description>DAC concurrent mode 8-bit right-aligned data holding register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC1_DH</name>
              <description>DAC1 8-bit right-aligned data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC0_DH</name>
              <description>DAC0 8-bit right-aligned data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_DO</name>
        <displayName>DAC_OUT0_DO</displayName>
        <description>DAC0 data output register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC0_DO</name>
              <description>DAC0 data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DAC_OUT1_DO</name>
        <displayName>DAC_OUT1_DO</displayName>
        <description>DAC1 data output register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DAC1_DO</name>
              <description>DAC1 data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DDUDR1</name>
              <description>DAC1 DMA underrun flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDUDR0</name>
              <description>DAC0 DMA underrun flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
