burakenez/gd32f5xx-demo-suites-cmake-vscode/Projects/GD32F527I_EVAL/11_I2C_EEPROM/GD32F5xx.svd
      <register>
        <name>NPINTEN2</name>
        <displayName>NPINTEN2</displayName>
        <description>NAND flash/PC card interrupt enable registe 2</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000042</resetValue>
        <fields>
            <field>
              <name>FFEPT</name>
              <description>FIFO empty flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFEN</name>
              <description>Falling edge detection interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTHEN</name>
              <description>High-level detection interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN</name>
              <description>Rising edge detection interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFS</name>
              <description>Falling edge flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTHS</name>
              <description>High-level flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRS</name>
              <description>Rsing edge flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPINTEN3</name>
        <displayName>NPINTEN3</displayName>
        <description>NAND flash/PC card interrupt enable registe 3</description>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000042</resetValue>
        <fields>
            <field>
              <name>FFEPT</name>
              <description>FIFO empty flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFEN</name>
              <description>Falling edge detection interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTHEN</name>
              <description>High-level detection interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN</name>
              <description>Rising edge detection interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFS</name>
              <description>Falling edge flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTHS</name>
              <description>High-level flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRS</name>
              <description>Rsing edge flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPCTCFG1</name>
        <displayName>NPCTCFG1</displayName>
        <description>NAND flash/PC card common space timing configuration registe 1</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>COMHIZ</name>
              <description>Common memory data bus HiZ time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMHLD</name>
              <description>Common memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMWAIT</name>
              <description>Common memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMSET</name>
              <description>Common memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPCTCFG2</name>
        <displayName>NPCTCFG2</displayName>
        <description>NAND flash/PC card common space timing configuration registe 2</description>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>COMHIZ</name>
              <description>Common memory data bus HiZ time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMHLD</name>
              <description>Common memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMWAIT</name>
              <description>Common memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMSET</name>
              <description>Common memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPCTCFG3</name>
        <displayName>NPCTCFG3</displayName>
        <description>NAND flash/PC card common space timing configuration registe 3</description>
        <addressOffset>0xa8</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>COMHIZ</name>
              <description>Common memory data bus HiZ time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMHLD</name>
              <description>Common memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMWAIT</name>
              <description>Common memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMSET</name>
              <description>Common memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPATCFG1</name>
        <displayName>NPATCFG1</displayName>
        <description>NAND flash/PC card attribute space timing configuration registe 1</description>
        <addressOffset>0x6c</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>ATTHIZ</name>
              <description>Attribute memory data bus HiZ time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTHLD</name>
              <description>Attribute memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>Attribute memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTSET</name>
              <description>Attribute memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPATCFG2</name>
        <displayName>NPATCFG2</displayName>
        <description>NAND flash/PC card attribute space timing configuration registe 2</description>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>ATTHIZ</name>
              <description>Attribute memory data bus HiZ time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTHLD</name>
              <description>Attribute memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>Attribute memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTSET</name>
              <description>Attribute memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPATCFG3</name>
        <displayName>NPATCFG3</displayName>
        <description>NAND flash/PC card attribute space timing configuration registe 3</description>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>ATTHIZ</name>
              <description>Attribute memory data bus HiZ time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTHLD</name>
              <description>Attribute memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>Attribute memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTSET</name>
              <description>Attribute memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PIOTCFG3</name>
        <displayName>PIOTCFG3</displayName>
        <description>PC card I/O space timing configuration register</description>
        <addressOffset>0xB0</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>IOHIZ</name>
              <description>IO space data bus HiZ time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOHLD</name>
              <description>IO space hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOWAIT</name>
              <description>IO space wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOSET</name>
              <description>IO space setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDCTL0</name>
        <displayName>SDCTL0</displayName>
        <description>SDRAM control registe 0</description>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
        <resetValue>0x000002D0</resetValue>
        <fields>
            <field>
              <name>ECC</name>
              <description>ECC result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDCTL1</name>
        <displayName>SDCTL1</displayName>
        <description>SDRAM control registe 1</description>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
        <resetValue>0x000002D0</resetValue>
        <fields>
            <field>
              <name>ECC</name>
              <description>ECC result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDTCFG0</name>
        <displayName>SDTCFG0</displayName>
        <description>SDRAM timing configuration registe 0</description>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>PIPED</name>
              <description>Pipeline delay</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRSTRD</name>
              <description>Burst read</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDCLK</name>
              <description>SDRAM clock configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPEN</name>
              <description>Write protection enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CL</name>
              <description>CAS Latency</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NBK</name>
              <description>Number of banks</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDW</name>
              <description>SDRAM data bus width.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAW</name>
              <description>Row address bit width</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAW</name>
              <description>Column address bit width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDTCFG1</name>
        <displayName>SDTCFG1</displayName>
        <description>SDRAM timing configuration registe 1</description>
        <addressOffset>0x14c</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>PIPED</name>
              <description>Pipeline delay</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRSTRD</name>
              <description>Burst read</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDCLK</name>
              <description>SDRAM clock configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPEN</name>
              <description>Write protection enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CL</name>
              <description>CAS Latency</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NBK</name>
              <description>Number of banks</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDW</name>
              <description>SDRAM data bus width.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAW</name>
              <description>Row address bit width</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAW</name>
              <description>Column address bit width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDCMD</name>
        <displayName>SDCMD</displayName>
        <description>SDRAM command register</description>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>RCD</name>
              <description>Row to column delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPD</name>
              <description>Row precharge delay</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRD</name>
              <description>Write recovery delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARFD</name>
              <description>Auto refresh delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RASD</name>
              <description>Row address select delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XSRD</name>
              <description>Exit self-refresh delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LMRD</name>
              <description>Load mode register delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
