burakenez/gd32f5xx-demo-suites-cmake-vscode/Projects/GD32F527I_EVAL/11_I2C_EEPROM/GD32F5xx.svd
    </registers>
</peripheral>
<peripheral>
    <name>FMC</name>
    <description>Flash memory controller</description>
    <groupName>FMC</groupName>
    <baseAddress>0x40023C00</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
	<interrupt>
        <name>FMC</name>
        <value>4</value>
      </interrupt>
    <registers>
      <register>
        <name>KEY</name>
        <displayName>KEY</displayName>
        <description>Unlock key register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>KEY</name>
              <description>FMC_CTL unlock register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBKEY</name>
        <displayName>OBKEY</displayName>
        <description>Option byte unlock key register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OBKEY</name>
              <description>FMC_OBCTLx option byte operation unlock register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BUSY</name>
              <description>The flash is busy bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDCERR</name>
              <description>Read CBUS protection error flag bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGSERR</name>
              <description>Program sequence error flag bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMERR</name>
              <description>Program size not match error flag bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAERR</name>
              <description>Program alignment error flag bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPERR</name>
              <description>Erase/Program protection error flag bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDECCDET</name>
              <description>Two bits ECC error flag bit when load code.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPERR</name>
              <description>Flash operation error flag bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>End of operation flag bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x80000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>FMC_CTL lock bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLBP</name>
              <description>Read lock block protection for OTP2.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NWLDE</name>
              <description>Enable no wait time area load when system reset. This bit is only restored by power on reset.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDECCIE</name>
              <description>Load code ECC error interrupt enable bit.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable bit.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIE</name>
              <description>End of operation interrupt enable bit.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>send erase command to FMC bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MER1</name>
              <description>main flash mass erase for bank1command bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SN_5</name>
              <description>Refer to SN[4:0].</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWPGE</name>
              <description>Double word program size bit enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSZ</name>
              <description>Program size bit when DWPGE=0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SN_0_4</name>
              <description>Select which sector number to be erased.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MER0</name>
              <description>main flash mass erase for bank0 command bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SER</name>
              <description>main flash sector erase command bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG</name>
              <description>main flash program command bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBCTL0</name>
        <displayName>OBCTL0</displayName>
        <description>Option byte control register 0</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DRP</name>
              <description>CBUS data read protection bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NWA</name>
              <description>Select no wait time area.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC enable bit.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WP0</name>
              <description>Erase/program protection of each sector when DRP is 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPC</name>
              <description>option byte security protection code.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nRST_STDBY</name>
              <description>option byte standby reset value.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nRST_DPSLP</name>
              <description>option byte deepsleep reset value.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nWDG_HW</name>
              <description>option byte watchdog value.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB</name>
              <description>option byte boot bank value.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOR_TH</name>
              <description>option byte BOR threshold value.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OB_START</name>
              <description>send option byte change command to FMC bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OB_LK</name>
              <description>FMC_OBCTLx lock bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
            <name>OBCTL1</name>
            <displayName>OBCTL1</displayName>
            <description>Option byte control register 1</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>WP1_0_11</name>
                    <description>Erase/program protection of each sector when DRP is 0</description>
                    <bitOffset>16</bitOffset>
                    <bitWidth>12</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>WP1_12_19</name>
                    <description>Erase/program protection of each sector when DRP is 0</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>WP0</name>
                    <description>Erase/program protection of each sector when DRP is 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
      <register>
        <name>PECFG</name>
        <displayName>PECFG</displayName>
        <description>Page erase configuration register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PE_EN</name>
              <description>The enable bit of page erase function</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE_ADDR</name>
              <description>Page address (4KB alignment).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PEKEY</name>
        <displayName>PEKEY</displayName>
        <description>Unlock page erase key register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PE_KEY</name>
              <description>FMC_PECFG unlock register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OTP1CFG</name>
        <displayName>OTP1CFG</displayName>
        <description>OTP1 configuration register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000FFFF</resetValue>
        <fields>
            <field>
              <name>OTP1REN</name>
              <description>OTP1 read enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDECCADDR0</name>
        <displayName>LDECCADDR0</displayName>
        <description>Load code ECC error address0</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>LDECCADDR0</name>
              <description>ECC two bits error base address (aligned to 64bit) when load code from main flash / bootloader OTP1. Any bits in 64bit may be wrong.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDECCADDR1</name>
        <displayName>LDECCADDR1</displayName>
        <description>Load code ECC error address1</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>LDECCADDR1</name>
              <description>ECC two bits error base address (aligned to 64bit) when load code from main flash / bootloader OTP1. Any bits in 64bit may be wrong.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDECCADDR2</name>
        <displayName>LDECCADDR2</displayName>
        <description>Load code ECC error address2</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0xFFFFFFFF</resetValue>
        <fields>
            <field>
              <name>LDECCADDR2</name>
              <description>ECC two bits error base address (aligned to 64bit) when load code from main flash / bootloader OTP1. Any bits in 64bit may be wrong.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBSTAT</name>
        <displayName>OBSTAT</displayName>
        <description>Option bytes status register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SPCH</name>
              <description>Security protection is level high now.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPCL</name>
              <description>Security protection is level low now.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PID</name>
        <displayName>PID</displayName>
        <description>Product ID register</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PID</name>
              <description>Product reserved ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>EFUSE_CS</name>
        <displayName>EFUSE_CS</displayName>
        <description>Efuse control and status register</description>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OVBERIC</name>
              <description>Clear bit for overstep boundary error interrupt flag.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDIC</name>
              <description>Clear bit for read operation completed interrupt flag.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGIC</name>
              <description>Clear bit for program operation completed interrupt flag.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVBERIE</name>
              <description>Enable bit for overstep boundary error interrupt.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDIE</name>
              <description>Enable bit for read operation completed interrupt.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGIE</name>
              <description>Enable bit for program operation completed interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVBERIF</name>
              <description>Overstep boundary error flag.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDIF</name>
              <description>Read operation complete flag.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PGIF</name>
              <description>Program operation completed flag.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EFBYP</name>
              <description>Efuse LDO bypass. This bit can be set only when EFSTR is 0. And users should make sure the external voltage supply is stable before seting EFSTR if set this bit. The program voltage should whitin 2.25V~2.75V. And typical voltage is 2.5V.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFRW</name>
              <description>The selection of efuse operation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFSTR</name>
              <description>Start efuse operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>EFUSE_ADDR</name>
        <displayName>EFUSE_ADDR</displayName>
        <description>Efuse address register</description>
        <addressOffset>0x204</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>EFSIZE</name>
              <description>Read or write efuse data size.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFADDR</name>
              <description>Read or write efuse data start address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
