burakenez/gd32f5xx-demo-suites-cmake-vscode/Projects/GD32F527I_EVAL/11_I2C_EEPROM/GD32F5xx.svd
        <register>
            <name>SAMCS</name>
            <displayName>SAMCS</displayName>
            <description>SAM control and status register</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>RFR</name>
                    <description>Rxframe rise flag, cleared by software by writing 0</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>RFF</name>
                    <description>Rxframe fall flag, cleared by software by writing 0</description>
                    <bitOffset>14</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TFR</name>
                    <description>Txframe rise flag, cleared by software by writing 0</description>
                    <bitOffset>13</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TFF</name>
                    <description>Txframe fall flag, cleared by software by writing 0</description>
                    <bitOffset>12</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>RXF</name>
                    <description>Level of rxframe signal</description>
                    <bitOffset>9</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>TXF</name>
                    <description>Level of txframe signal</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>RFRIE</name>
                    <description>Rxframe rise interrupt enable</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>RFFIE</name>
                    <description>Rxframe fall interrupt enable</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TFRIE</name>
                    <description>Txframe rise interrupt enable</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TFFIE</name>
                    <description>Txframe fall interrupt enable</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>STOEN</name>
                    <description>SAM_V interface timeout detect enable</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SAMEN</name>
                    <description>SAM_V interface enable</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
    </registers>
</peripheral>
<peripheral derivedFrom="I2C0">
    <name>I2C1</name>
    <baseAddress>0x40005800</baseAddress>
    <interrupt>
        <name>I2C1_EV</name>
        <value>33</value>
    </interrupt>
    <interrupt>
        <name>I2C1_ER</name>
        <value>34</value>
    </interrupt>
</peripheral>
<peripheral derivedFrom="I2C0">
    <name>I2C2</name>
    <baseAddress>0x40005C00</baseAddress>
    <interrupt>
        <name>I2C2_EV</name>
        <value>72</value>
    </interrupt>
    <interrupt>
        <name>I2C2_ER</name>
        <value>73</value>
    </interrupt>
</peripheral>
<peripheral>
    <name>I2C3</name>
    <description>Inter-integrated circuit interface</description>
    <groupName>I2C</groupName>
    <baseAddress>0x40008000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>I2C3_EV</name>
        <value>92</value>
    </interrupt>
    <interrupt>
        <name>I2C3_ER</name>
        <value>93</value>
    </interrupt>
    <interrupt>
        <name>I2C3_WAKE</name>
        <value>98</value>
    </interrupt>
    <registers>
        <register>
            <name>CTL0</name>
            <displayName>CTL0</displayName>
            <description>Control register 0</description>
            <addressOffset>0x00</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>PECEN</name>
                    <description>PEC Calculation Switch</description>
                    <bitOffset>23</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SMBALTEN</name>
                    <description>SMBus Alert enable</description>
                    <bitOffset>22</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SMBDAEN</name>
                    <description>SMBus device default address enable</description>
                    <bitOffset>21</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SMBHAEN</name>
                    <description>SMBus Host address enable</description>
                    <bitOffset>20</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>GCEN</name>
                    <description>Whether or not to response to a General Call (0x00)</description>
                    <bitOffset>19</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>WUEN</name>
                    <description>Wakeup from power saving mode enable</description>
                    <bitOffset>18</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SS</name>
                    <description>Whether to stretch SCL low when data is not ready in slave mode</description>
                    <bitOffset>17</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SBCTL</name>
                    <description>Slave byte control</description>
                    <bitOffset>16</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DENR</name>
                    <description>DMA enable for reception</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DENT</name>
                    <description>DMA enable for transmission</description>
                    <bitOffset>14</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ANOFF</name>
                    <description>Analog noise filter disable</description>
                    <bitOffset>12</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DNF</name>
                    <description>Digital noise filter</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>4</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ERRIE</name>
                    <description>Error interrupt enable</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TCIE</name>
                    <description>Transfer complete interrupt enable</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>STPDETIE</name>
                    <description>Stop detection interrupt enable</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>NACKIE</name>
                    <description>Not acknowledge received interrupt enable</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDMIE</name>
                    <description>Address match interrupt enable in slave mode</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>RBNEIE</name>
                    <description>Receive interrupt enable</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TIE</name>
                    <description>Transmit interrupt enable</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>I2CEN</name>
                    <description>I2C peripheral enable</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>CTL1</name>
            <displayName>CTL1</displayName>
            <description>Control register 1</description>
            <addressOffset>0x04</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>PECTRANS</name>
                    <description>PEC Transfer</description>
                    <bitOffset>26</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>AUTOEND</name>
                    <description>Automatic end mode in master mode</description>
                    <bitOffset>25</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>RELOAD</name>
                    <description>Reload mode</description>
                    <bitOffset>24</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>BYTENUM</name>
                    <description>Number of bytes to be transferred</description>
                    <bitOffset>16</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>NACKEN</name>
                    <description>Generate NACK in slave mode</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>STOP</name>
                    <description>Generate a STOP signal on I2C bus</description>
                    <bitOffset>14</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>START</name>
                    <description>Generate a START condition on I2C bus</description>
                    <bitOffset>13</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>HEAD10R</name>
                    <description>10-bit address header executes read direction only in master receive mode</description>
                    <bitOffset>12</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADD10EN</name>
                    <description>10-bit addressing mode enable in master mode</description>
                    <bitOffset>11</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TRDIR</name>
                    <description>Transfer direction in master mode</description>
                    <bitOffset>10</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SADDRESS</name>
                    <description>Slave address to be sent</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>10</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>SADDR0</name>
            <displayName>SADDR0</displayName>
            <description>Slave address register 0</description>
            <addressOffset>0x08</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>ADDRESSEN</name>
                    <description>I2C address enable</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDFORMAT</name>
                    <description>Address mode for the I2C slave</description>
                    <bitOffset>10</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDRESS_8_9</name>
                    <description>Highest two bits of a 10-bit address</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>2</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDRESS_1_7</name>
                    <description>7-bit address or bits 7:1 of a 10-bit address</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>7</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDRESS0</name>
                    <description>Bit 0 of a 10-bit address</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>SADDR1</name>
            <displayName>SADDR1</displayName>
            <description>Slave address register 1</description>
            <addressOffset>0x0C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>ADDRESS2EN</name>
                    <description>Second I2C address enable</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDMSK2</name>
                    <description>ADDRESS2[7:1] mask</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>3</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDRESS2</name>
                    <description>Second I2C address for the slave</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>7</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>TIMING</name>
            <displayName>TIMING</displayName>
            <description>Timing register</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>PSC</name>
                    <description>Timing prescaler</description>
                    <bitOffset>28</bitOffset>
                    <bitWidth>4</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SCLDELY</name>
                    <description>Data setup time</description>
                    <bitOffset>20</bitOffset>
                    <bitWidth>4</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SDADELY</name>
                    <description>Data hold time</description>
                    <bitOffset>16</bitOffset>
                    <bitWidth>4</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SCLH</name>
                    <description>SCL high period</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SCLL</name>
                    <description>SCL low period</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>TIMEOUT</name>
            <displayName>TIMEOUT</displayName>
            <description>Timeout register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>EXTOEN</name>
                    <description>Extended clock timeout detection enable</description>
                    <bitOffset>31</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>BUSTOB</name>
                    <description>Bus timeout B</description>
                    <bitOffset>16</bitOffset>
                    <bitWidth>12</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TOEN</name>
                    <description>Clock timeout detection enable</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TOIDLE</name>
                    <description>Idle clock timeout detection</description>
                    <bitOffset>12</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>BUSTOA</name>
                    <description>Bus timeout A</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>12</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
