burakenez/gd32f5xx-demo-suites-cmake-vscode/Projects/GD32F527I_EVAL/11_I2C_EEPROM/GD32F5xx.svd
      <register>
        <name>CCHP</name>
        <displayName>CCHP</displayName>
        <description>Complementary channel protection register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>POEN</name>
              <description>Primary output enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OAEN</name>
              <description>Output automatic enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRKP</name>
              <description>Break input polarity</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRKEN</name>
              <description>Break input enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROS</name>
              <description>Run mode off-state enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOS</name>
              <description>Idle mode off-state enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROT</name>
              <description>Complementary register protect control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCFG</name>
              <description>Dead time configure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMACFG</name>
        <displayName>DMACFG</displayName>
        <description>DMA configuration register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>DMATC</name>
              <description>DMA transfer count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMATA</name>
              <description>DMA transfer access start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMATB</name>
        <displayName>DMATB</displayName>
        <description>DMA transfer buffer register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>DMATB</name>
              <description>DMA transfer buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH0COMV_ADD</name>
        <displayName>CH0COMV_ADD</displayName>
        <description>Channel 0 additional compare value register</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0COMVAL_ADD</name>
              <description>Additional compare value of channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH1COMV_ADD</name>
        <displayName>CH1COMV_ADD</displayName>
        <description>Channel 1 additional compare value register</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH1COMVAL_ADD</name>
              <description>Additional compare value of channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH2COMV_ADD</name>
        <displayName>CH2COMV_ADD</displayName>
        <description>Channel 2 additional compare value register</description>
        <addressOffset>0x6C</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH2COMVAL_ADD</name>
              <description>Additional compare value of channel 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH3COMV_ADD</name>
        <displayName>CH3COMV_ADD</displayName>
        <description>Channel 3 additional compare value register</description>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH3COMVAL_ADD</name>
              <description>Additional compare value of channel 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL2</name>
        <displayName>CTL2</displayName>
        <description>Control register 2</description>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH3CPWMEN</name>
              <description>Channel 3 composite PWM mode enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CPWMEN</name>
              <description>Channel 2 composite PWM mode enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CPWMEN</name>
              <description>Channel 1 composite PWM mode enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CPWMEN</name>
              <description>Channel 0 composite PWM mode enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0xFC</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CHVSEL</name>
              <description>Write CHxVAL register selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSEL</name>
              <description>The output value selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
