burakenez/gd32f5xx-demo-suites-cmake-vscode/Projects/GD32F527I_EVAL/11_I2C_EEPROM/GD32F5xx.svd
      </registers>
    </peripheral>
<peripheral>
    <name>TIMER10</name>
    <description>General level2 timer</description>
    <groupName>TIMER</groupName>
    <baseAddress>0x40014800</baseAddress>
    <addressBlock>
    <offset>0x0</offset>
    <size>0x400</size>
    <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register 0</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CKDIV</name>
              <description>Clock division</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARSE</name>
              <description>Auto-reload shadow enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPS</name>
              <description>Update source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDIS</name>
              <description>Update disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEN</name>
              <description>Counter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>MMC</name>
              <description>Master mode control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAINTEN</name>
        <displayName>DMAINTEN</displayName>
        <description>Interrupt enable register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0IE</name>
              <description>Channel 0 capture/compare interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPIE</name>
              <description>Update interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <displayName>INTF</displayName>
        <description>Interrupt flag register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0OF</name>
              <description>Channel 0 over capture flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0IF</name>
              <description>Channel 0 capture/compare interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPIF</name>
              <description>Update interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWEVG</name>
        <displayName>SWEVG</displayName>
        <description>Software event generation register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0G</name>
              <description>Channel 0 capture or compare event generation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UPG</name>
              <description>This bit can be set by software, and cleared by hardware automatically. When this bit is set, the counter is cleared. The prescaler counter is cleared at the same time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CHCTL2</name>
        <displayName>CHCTL2</displayName>
        <description>Channel control register 2</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0NP</name>
              <description>Channel 0 complementary output polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0P</name>
              <description>Channel 0 capture/compare polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0EN</name>
              <description>Channel 0 capture/compare function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CNT</name>
        <displayName>CNT</displayName>
        <description>Counter register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CNT</name>
              <description>This bit-filed indicates the current counter value. Writing to this bit-filed can change the value of the counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>Prescaler register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>PSC</name>
              <description>Prescaler value of the counter clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CAR</name>
        <displayName>CAR</displayName>
        <description>Counter auto reload register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue> 0x0000FFFF</resetValue>
        <fields>
            <field>
              <name>CARL</name>
              <description>Counter auto reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH0CV</name>
        <displayName>CH0CV</displayName>
        <description>Channel 0 capture/compare value register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0VAL</name>
              <description>Capture or compare value of channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IRMP</name>
        <displayName>IRMP</displayName>
        <description>Input remap register</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>ITI1_RMP</name>
              <description>Write CHxVAL register selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0xFC</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CHVSEL</name>
              <description>Write CHxVAL register selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
