burakenez/gd32f5xx-demo-suites-cmake-vscode/Projects/GD32F527I_EVAL/11_I2C_EEPROM/GD32F5xx.svd
      </registers>
</peripheral>
  <peripheral derivedFrom="TIMER8">
      <name>TIMER11</name>
      <groupName>TIMER</groupName>
      <baseAddress>0x40001800</baseAddress>
      <interrupt>
        <name>TIMER7_BRK_TIMER11</name>
        <value>43</value>
      </interrupt>
    </peripheral>
  <peripheral derivedFrom="TIMER9">
      <name>TIMER12</name>
      <groupName>TIMER</groupName>
      <baseAddress>0x40001C00</baseAddress>
      <interrupt>
        <name>TIMER7_UP_TIMER12</name>
        <value>44</value>
      </interrupt>
    </peripheral>
  <peripheral derivedFrom="TIMER9">
      <name>TIMER13</name>
      <groupName>TIMER</groupName>
      <baseAddress>0x40002000</baseAddress>
      <interrupt>
        <name>TIMER7_TRG_CMT_TIMER13</name>
        <value>45</value>
      </interrupt>
    </peripheral>
<peripheral>
    <name>TLI</name>
    <description>TFT-LCD interface</description>
    <groupName>TLI</groupName>
    <baseAddress>0x40016800</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
	<interrupt>
        <name>TLI_ER</name>
        <value>89</value>
      </interrupt>
     <interrupt>
        <name>TLI</name>
        <value>88</value>
      </interrupt>
    <registers>
      <register>
        <name>SPSZ</name>
        <displayName>SPSZ</displayName>
        <description>Synchronous pulse size register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>HPSZ</name>
              <description>Size of the horizontal synchronous pulse</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VPSZ</name>
              <description>Size of the vertical synchronous pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>BPSZ</name>
        <displayName>BPSZ</displayName>
        <description>Back-porch size register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>HBPSZ</name>
              <description>Size of the horizontal back porch plus synchronous pulse</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBPSZ</name>
              <description>Size of the vertical back porch plus synchronous pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ASZ</name>
        <displayName>ASZ</displayName>
        <description>Active size register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>HASZ</name>
              <description>Size of the horizontal active area width plus back porch and synchronous pulse</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VASZ</name>
              <description>Size of the vertical active area width plus back porch and synchronous pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TSZ</name>
        <displayName>TSZ</displayName>
        <description>Total size register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>HTSZ</name>
              <description>Horizontal total size of the display, including active area, back porch, synchronous pulse and front porch</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTSZ</name>
              <description>Vertical total size of the display, including active area, back porch, synchronous pulse and front porch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00002220</resetValue>
        <fields>
            <field>
              <name>HPPS</name>
              <description>Horizontal pulse polarity selection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VPPS</name>
              <description>Vertical pulse polarity selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEPS</name>
              <description>Data enable polarity selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKPS</name>
              <description>Pixel clock polarity selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFEN</name>
              <description>Dither function enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDB</name>
              <description>Red channel dither bits number</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GDB</name>
              <description>Green channel dither bits number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDB</name>
              <description>Blue channel dither bits number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TLIEN</name>
              <description>TLI enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>RL</name>
        <displayName>RL</displayName>
        <description>Reload layer register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FBR</name>
              <description>Frame blank reload</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQR</name>
              <description>Request reload</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>BGC</name>
        <displayName>BGC</displayName>
        <description>Background color register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BVR</name>
              <description>Background value red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVG</name>
              <description>Background value green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVB</name>
              <description>Background value blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTEN</name>
        <displayName>INTEN</displayName>
        <description>Interrupt enable register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LCRIE</name>
              <description>Layer configuration reloaded interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transaction error interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEIE</name>
              <description>FIFO error interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LMIE</name>
              <description>Line mark interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <displayName>INTF</displayName>
        <description>Interrupt flag register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LCRF</name>
              <description>Layer configuration reloaded flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEF</name>
              <description>Transaction error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FEF</name>
              <description>FIFO error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LMF</name>
              <description>Line mark flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTC</name>
        <displayName>INTC</displayName>
        <description>Interrupt flag clear register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LCRC</name>
              <description>Layer configuration reloaded flag clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TEC</name>
              <description>Transaction error flag clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FEC</name>
              <description>FIFO error flag clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LMC</name>
              <description>Line mark flag clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LM</name>
        <displayName>LM</displayName>
        <description>Line mark register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LM</name>
              <description>Line mark value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CPPOS</name>
        <displayName>CPPOS</displayName>
        <description>Current pixel position register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>HPOS</name>
              <description>Horizontal position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VPOS</name>
              <description>Vertical position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000000F</resetValue>
        <fields>
            <field>
              <name>HS</name>
              <description>Current HS status of the TLI</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VS</name>
              <description>Current VS status of the TLI</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDE</name>
              <description>Current HDE status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDE</name>
              <description>Current VDE status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0CTL</name>
        <displayName>L0CTL</displayName>
        <description>Layer 0 control regist</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LUTEN</name>
              <description>LUT enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYEN</name>
              <description>Color keying enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN</name>
              <description>Layer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1CTL</name>
        <displayName>L1CTL</displayName>
        <description>Layer 1 control regist</description>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LUTEN</name>
              <description>LUT enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYEN</name>
              <description>Color keying enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN</name>
              <description>Layer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0HPOS</name>
        <displayName>L0HPOS</displayName>
        <description>Layer 0 horizontal position parameters regist</description>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WRP</name>
              <description>Window right position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLP</name>
              <description>Window left position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1HPOS</name>
        <displayName>L1HPOS</displayName>
        <description>Layer 1 horizontal position parameters regist</description>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WRP</name>
              <description>Window right position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLP</name>
              <description>Window left position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0VPOS</name>
        <displayName>L0VPOS</displayName>
        <description>Layer 0 vertical position parameters regist</description>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WBP</name>
              <description>Window bottom position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WTP</name>
              <description>Window top position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1VPOS</name>
        <displayName>L1VPOS</displayName>
        <description>Layer 1 vertical position parameters regist</description>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WBP</name>
              <description>Window bottom position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WTP</name>
              <description>Window top position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0CKEY</name>
        <displayName>L0CKEY</displayName>
        <description>Layer 0 color key regist</description>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CKEYR</name>
              <description>Color key red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYG</name>
              <description>Color key green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYB</name>
              <description>Color key blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1CKEY</name>
        <displayName>L1CKEY</displayName>
        <description>Layer 1 color key regist</description>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CKEYR</name>
              <description>Color key red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYG</name>
              <description>Color key green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYB</name>
              <description>Color key blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
